## Data Encoding
  1. Nominal/OHE Encoding
  2. Label adn Ordinal Encoding
  3. Target Guided Ordinal Encoding

## Nominal/OHE Encoding
One hot encoding also known as nominal encoding, is a technique used to represent catogorical data as numerical data which is more suitable for machine learning algorithm, In this technique, each category is represented as a binary vector where each bit corresponds to a unique category. For Example, if we have a categorical variable "color" with three possible values (red, green, blue), we can represent it one hot encoding as follows

1. Red:[1,0,0]
2. Green:[0,1,0]
3. Blue:[0,0,1]

In [2]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [3]:
## Create a simple DataFrame
df= pd.DataFrame({
    'color':['red','blue','green','green','red','blue']
})

In [4]:
df.head()

   color
0    red
1   blue
2  green
3  green
4    red

In [11]:
## create an instance of OneHotEncoder
encoder=OneHotEncoder()

In [12]:
# Perform fit and Tranform 
encoded=encoder.fit_transform(df[['color']]).toarray()

In [13]:
import pandas as pd
encoder_df=pd.DataFrame(encoded, columns=encoder.get_feature_names_out())

In [14]:
encoder_df

   color_blue  color_green  color_red
0         0.0          0.0        1.0
1         1.0          0.0        0.0
2         0.0          1.0        0.0
3         0.0          1.0        0.0
4         0.0          0.0        1.0
5         1.0          0.0        0.0

In [15]:
pd.concat([df,encoder_df], axis=1)

   color  color_blue  color_green  color_red
0    red         0.0          0.0        1.0
1   blue         1.0          0.0        0.0
2  green         0.0          1.0        0.0
3  green         0.0          1.0        0.0
4    red         0.0          0.0        1.0
5   blue         1.0          0.0        0.0

## Label Encoding
 Label encoding and ordinal encoding are two techniques used to encode categorical data as numerical data
 
 Label Encoding involves assigning a unique numerical label to each category in the variable. The labels are usually assigned in alphabetical order or based on the frequency of the categories. For example, If we have a categorical variable "color" with three possible values (red, green, blue), we an represent it using label encoding as follows:
 
 1. Red: 1
 2. Green: 2
 3. Blue: 3

In [16]:
df.head()

   color
0    red
1   blue
2  green
3  green
4    red

In [17]:
from sklearn.preprocessing import LabelEncoder
lbl_encoder=LabelEncoder()

In [18]:
lbl_encoder.fit_transform(df[['color']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 1, 2, 0])

In [19]:
lbl_encoder.transform([['red']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:134: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

In [20]:
lbl_encoder.transform([['blue']])

array([0])

In [21]:
lbl_encoder.transform([['green']])

array([1])

### Problem With this Label Encoder is : 
  - Model may thing that red has higher value than green and blue so this shouldn't happen

## Ordinal Encoder

  - It is used to encode categorical data that have an intrinsic order or ranking. In this technique, each category is assigned a numerical value based on its position in the order. For example, if we have a categorical variable "education level" with four possible values (high school, college, graduate, post-graduate,) we can represent it using ordinal encoding as follows:
  1. High School: 1
  2. College: 2
  3. Graduate: 3
  4. Post-graduate: 4

In [22]:
from sklearn.preprocessing import OrdinalEncoder

In [23]:
## create a sample dataFrame with an ordinal variable
df = pd.DataFrame({
    'size': ['small','medium','large','medium','small','large']
})

In [24]:
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [25]:
## Create an Instance of OrdinalEncoder and then fit_transform
encoder= OrdinalEncoder(categories=[['small','medium','large']])

In [26]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

In [27]:
encoder.transform([['small']])

/opt/conda/lib/python3.10/site-packages/sklearn/base.py:409: UserWarning: X does not have valid feature names, but OrdinalEncoder was fitted with feature names
  warnings.warn(

array([[0.]])

## Target Guided Ordinal Encoding
  - It is a technique used to encode categorical variable based on their relationship with the target variable. This encoding technique is useful when we have categorical variable with a large number of unique categories, and we want to use this variable as a feature in our machine learning model.
  - In Target Guided Ordinal Encoding, we replace each category in the categorical variable with a numerical value based on the mean or median of the target variable for that category, This creates a monotonic relationship between the categorical variable and the target variable, which can improve the predictive power of our model

In [28]:
import pandas as pd

## Create a sample DataFrame with a categorical variable and a target variable
df= pd.DataFrame({
    'city': ['New York', 'London', 'Paris', 'Tokyo', 'New York', 'Paris'],
    'price': [200,150,300,250,180,320]
})

In [29]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [32]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [33]:
mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [36]:
df['city_encoded']=df['city'].map(mean_price)

In [37]:
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0

In [39]:
df[['price','city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0